In [1]:
import pandas as pd

<h5> 2877 . Create DataFrame from a list</h5>

In [2]:

student_data = [[1,15],[2,11],[3,11],[4,20]]
data = pd.DataFrame(student_data, columns=['student_id', 'Age'], index=None)
data

   student_id  Age
0           1   15
1           2   11
2           3   11
3           4   20

<h5>2891. Method Chaining</h5>

In [3]:
#Write a solution to list the names of animals that weigh strictly more than 100 kilograms.
data = {
    'name': ['Tatiana', 'Khaled', 'Alex', 'Jonathan', 'Stefan', 'Tommy'],
    'species': ['Snake', 'Giraffe', 'Leopard', 'Monkey', 'Bear', 'Panda'],
    'age': [98, 50, 6, 45, 100, 26],
    'weight': [464, 41, 328, 463, 50, 349]
}

animals = pd.DataFrame(data)
animals.sort_values(by='weight', ascending=False, inplace=True)
a=animals[animals['weight'] > 100]['name']
a = pd.DataFrame(a)
a

       name
0   Tatiana
3  Jonathan
5     Tommy
2      Alex

<h5> 2878 Get the size of the dataframe.</h5>

In [4]:
players = [
    {"player_id": 846, "name": "Mason", "age": 21, "position": "Forward", "team": "RealMadrid"},
    {"player_id": 749, "name": "Riley", "age": 30, "position": "Winger", "team": "Barcelona"},
    {"player_id": 155, "name": "Bob", "age": 28, "position": "Striker", "team": "ManchesterUnited"},
    {"player_id": 583, "name": "Isabella", "age": 32, "position": "Goalkeeper", "team": "Liverpool"},
    {"player_id": 388, "name": "Zachary", "age": 24, "position": "Midfielder", "team": "BayernMunich"},
    {"player_id": 883, "name": "Ava", "age": 23, "position": "Defender", "team": "Chelsea"},
    {"player_id": 355, "name": "Violet", "age": 18, "position": "Striker", "team": "Juventus"},
    {"player_id": 247, "name": "Thomas", "age": 27, "position": "Striker", "team": "ParisSaint-Germain"},
    {"player_id": 761, "name": "Jack", "age": 33, "position": "Midfielder", "team": "ManchesterCity"},
    {"player_id": 642, "name": "Charlie", "age": 36, "position": "Center-back", "team": "Arsenal"}
]

players=pd.DataFrame(players)
a = players.shape
a = list(a)
type(a)

list

<h5>2879. Display the first three rows.</h5>

In [5]:
employees = [
    {"employee_id": 3, "name": "Bob", "department": "Operations", "salary": 48675},
    {"employee_id": 90, "name": "Alice", "department": "Sales", "salary": 11096},
    {"employee_id": 9, "name": "Tatiana", "department": "Engineering", "salary": 33805},
    {"employee_id": 60, "name": "Annabelle", "department": "InformationTechnology", "salary": 37678},
    {"employee_id": 49, "name": "Jonathan", "department": "HumanResources", "salary": 23793},
    {"employee_id": 43, "name": "Khaled", "department": "Administration", "salary": 40454}
]

employees = pd.DataFrame(employees)
# employees.iloc[:3,1] # works on indexing 
# employees.loc[:3, 'name'] # works on index names(row names) and column names
employees.iloc[:3,1 : 3]

      name   department
0      Bob   Operations
1    Alice        Sales
2  Tatiana  Engineering

<h5> 2880. Select Data</h5>

In [6]:
#Write a solution to select the name and age of the student with student_id = 101.
data = {
    "student_id": [101, 53, 100, 3],
    "name": ["Ulysses", "William", "Henry", "Henry"],
    "age": [13, 10, 6, 11]
}

students = pd.DataFrame(data)
a = (students[students['student_id']==101]).loc[:,'name':'age']

data  = students[students['student_id']==101][['name','age']]
# data

data = students.loc[students['student_id']==101,'name':]
data

data = students.loc[students['student_id']==101,'name':'age']
data

data = students.loc[students['student_id']==101,['name','age']]
data


data =  students[students['student_id']==101][1:2] #this wont work because [1:2] is applied on the result of students[students['student_id']==101] 
'''which is same like doing data = students[students['student_id']==101] and then data = data[1:2]'''

data

data = students[students['student_id']==101].iloc[:,1:3]  # using iloc
data

data = students.iloc[(students['student_id']==101).values,1:3] # using iloc
data

data = students.iloc[(students['student_id']==101).values][['name','age']]
data

# (students['student_id']==101) returns pandas series but .iloc expects array so ().values converts it to numpy boolean array.

      name  age
0  Ulysses   13

<h5> 2881. Create New Column</h5>

In [7]:
data = {
    'name': ['Piper', 'Grace', 'Georgia', 'Willow', 'Finn', 'Thomas'],
    'salary': [4548, 28150, 1103, 6593, 74576, 24433]
}

employees = pd.DataFrame(data)
employees['bonus'] = 2*employees['salary']
employees

      name  salary   bonus
0    Piper    4548    9096
1    Grace   28150   56300
2  Georgia    1103    2206
3   Willow    6593   13186
4     Finn   74576  149152
5   Thomas   24433   48866

2882. Drop Duplicate Rows

Delete the rows based on the duplicate emails keep the first occurence delete rest.

In [64]:
data =pd.DataFrame({
    'customer_id': [1, 2, 3, 4, 5, 6],
    'name': ['Ella', 'David', 'Zachary', 'Alice', 'Finn', 'Violet'],
    'email': [
        'emily@example.com',
        'michael@example.com',
        'sarah@example.com',
        'john@example.com',
        'john@example.com',
        'alice@example.com'
    ]
})

duplicates = data[data.duplicated('email')]

data.drop(duplicates.index)

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
5            6   Violet    alice@example.com

In [ ]:
df = pd.DataFrame([
    [1, 2],
    [3, 4]
], columns=['A', 'A'])

df.insert(2,"A",[2,3],allow_duplicates=True)

print(df)

   A  A  A
0  1  2  2
1  3  4  3

iterating in dataframe over rows.

In [40]:
import pandas as pd

df = pd.DataFrame({'name': ['Alice', 'Bob'], 'age': [25, 30]})

for index, row in df.iterrows():
    print(f"Index: {index}, Name: {row['name']}, Age: {row['age']}")

Index: 0, Name: Alice, Age: 25
Index: 1, Name: Bob, Age: 30

2883. Drop Missing Data.
There are some rows having missing values in the name column.

In [76]:
data = {
    'student_id': [32, 217, 779, 849],
    'name': ['Piper', None, 'Georgia', 'Willow'],
    'age': [5, 19, 20, None]
}

df = pd.DataFrame(data)

df.dropna() # this drops the row having any value as null or none we have to drop only that row where name is none or null

df.dropna(subset=['name']) # this will only drop the row in which name is na or none 

df.dropna(axis='columns')

   student_id
0          32
1         217
2         779
3         849